<?php

namespace Database\Seeders\Category;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $categories = [
            [
                'project_id'  => 1,
                'name'        => [
                    'en' => '',
                    'ar' => 'تراث السلام'
                ],
                'description' => [
                    'en' => '',
                    'ar' => 'الممارسات الثقافية أو التاريخية التي عززت الانسجام والتعايش بين المجموعات المختلفة، حالات من الثقافات والممارسات والتقاليد المختلفة التي ساهمت ولا تزال تساهم في التماسك المجتمعي وبناء السلام.'
                ],
            ],
            [
                'project_id'  => 1,
                'name'        => [
                    'en' => '',
                    'ar' => 'جهودنا قوة تجمعنا'
                ],
                'description' => [
                    'en' => '',
                    'ar' => 'حكايا المبادرات والأفعال الجماعية التي أطلقتها المجتمعات المحلية، وحلول إبداعية عززت الترابط الاجتماعي، واستلهمت القوة من الدعم الجماعي. من خلال الجهود المشتركة، تحولت العقبات والتحديات إلى فرص جديدة للتماسك والتعاون، ومهدت الطريق إلى مستقبل أكثر استدامةً وانسجاماً.',
                ]
            ],
            [
                'project_id'  => 1,
                'name'        => [
                    'en' => '',
                    'ar' => 'الاحتفال بجمال الإنسان'
                ],
                'description' => [
                    'en' => '',
                    'ar' => 'حكايا تسلط الضوء على أمثلة لأشخاص اتخذوا خطوات لتحقيق إنجازات ذات أثر يساهم في تحسين جودة الحياة الحالية، والسعي نحو مستقبل يحتوي خيارات وفرص متنوعة، وكانت مبادراتهم مصدر إلهام للآخرين.'
                ],
            ],
            [
                'project_id'  => 1,
                'name'        => [
                    'en' => '',
                    'ar' => 'التناغم اليومي'
                ],
                'description' => [
                    'en' => '',
                    'ar' => 'طرق ومسارات صغيرة، ولكنها ذات معنى يساهم بها السوريون في تحقيق السلام في حياتهم اليومية، مما يعزز الترابط، والتماسك المجتمعي، نسلط من خلالها الضوء أيضاً عن كيفية مساهمة العلاقات الشخصية والمجتمعية في تلبية الحاجات الإنسانية المشتركة.',
                ]
            ],
            [
                'project_id'  => 1,
                'name'        => [
                    'en' => '',
                    'ar' => 'نقاط التحول'
                ],
                'description' => [
                    'en' => '',
                    'ar' => 'لحظات فارقة ومواقف إنسانية تترك أثراً عميقاً في حياة الأفراد والمجتمعات، حيث تتغير المسارات وتُفتح أبواب جديدة نحو السلام الداخلي والخارجي. تتجسد هنا التجارب التي تعيد رسم العلاقات، وتخلق مساحات جديدة للتفاهم، حيث يتحول الألم إلى فرصة، ويصبح التأمل فيها دعوةً لاستلهام المعنى من التجربة، وتحويله إلى وعيٍ يعيد تشكيل رؤيتنا للحياة.'
                ],
            ],
            [
                'project_id'  => 1,
                'name'        => [
                    'en' => '',
                    'ar' => 'حل وتحويل النزاعات'
                ],
                'description' => [
                    'en' => '',
                    'ar' => 'قصص عن أفراد استعملت نهجاً بديلاً في التعامل مع التوترات، مما يمكنها من تحويل النزاعات، وتعزيز الحوار، وبناء جسور بين الأفراد والجماعات. هذه التجارب تسلط الضوء على ديناميكيات التحول التي تُمكّن المجتمعات من تحقيق الاستقرار والانسجام، وتحويل اللحظات الصعبة إلى فرص للتواصل والتطور.'
                ],
            ],
            [
                'project_id'  => 1,
                'name'        => [
                    'en' => '',
                    'ar' => 'الثقافة والفن جسور السلام'
                ],
                'description' => [
                    'en' => '',
                    'ar' => 'مثلة عن كيف تم استعمال الفن والموسيقى والشعر والفنون الأخرى في توحيد المجتمعات وتعزيز الشفاء، حيث لعبت هذه الوسائل الإبداعية دوراً في بناء الجسور، وإعادة إحياء الروابط الإنسانية',
                ]
            ],
            [
                'project_id'  => 1,
                'name'        => [
                    'en' => '',
                    'ar' => 'الروحانية لتعزيز السلام'
                ],
            ],
        ];

        foreach ($categories as $category) {
            \App\Models\Category\Category::create($category);
        }
    }
}
